Revit 2026 API

# ExternalResourceServerExtensions Properties

---

The ExternalResourceServerExtensions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ExternalResourceServerExtensions Class

Autodesk.Revit.DB Namespace